# InitCheck Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule..::..InitCheck Method
IPerformanceAdviserRule Interface See Also
---
Invoked by performance advisor once in the beginning of the check. If rule checks document as a whole, the check can be performed in this method.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
void InitCheck(
	Document document
)
```

Visual Basic
---
```text
Sub InitCheck ( _
	document As Document _
)
```

Visual C++
---
```text
void InitCheck(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document for which performance problems are being checked.
# See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace